{"id": "mem_001", "text": "Watching My Little Pony: The One Way Rainbow reminded Yahya of his friend Brady Colin. The show brought back a warm feeling of connection and friendship that he deeply cherished.", "tags": ["My Little Pony", "Brady Colin", "friendship"], "emotion": "comfort", "vocabulary": ["My Little Pony", "Brady Colin", "friendship"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.9, "memory_type": "media"}
{"id": "mem_002", "text": "Yahya used to get nervous visiting Dr. Lockett office for checkups and flu shots. The experience always reminded him of Elmo, which slightly softened the anxiety.", "tags": ["doctor", "Elmo"], "emotion": "nervous", "vocabulary": ["Dr. Lockett", "Elmo", "checkup", "flu shot"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_003", "text": "Toys R Us was once a magical place for Yahya, deeply connected in his mind with My Little Pony. Over time, this mental association began to shift, becoming a little confusing.", "tags": ["Toys R Us", "My Little Pony"], "emotion": "nostalgia", "vocabulary": ["Toys R Us", "My Little Pony", "magical"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.7, "memory_type": "location"}
{"id": "mem_004", "text": "Downstairs in Strausser, Yahya always felt something was not right. He could not express himself and it felt like his mind was being affected in ways he could not understand. He even remembers taking a video there that looked different in his mind later.", "tags": ["Strausser", "video", "overwhelmed"], "emotion": "distress", "vocabulary": ["Strausser", "video", "mind", "affected"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.85, "memory_type": "school"}
{"id": "mem_005", "text": "Yahya used to love flying and visiting Houston, but as he entered 10th grade, all that fun disappeared. He got tired of doing the same things over and over again.", "tags": ["Houston", "flying", "change"], "emotion": "disinterest", "vocabulary": ["Houston", "airplane", "tired", "10th grade"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.75, "memory_type": "growth"}
{"id": "mem_006", "text": "Seeing an ambulance reminds Yahya of Sesame Street and a time when his grandmother was taken to the hospital. These moments trigger feelings of sadness and uncertainty.", "tags": ["ambulance", "Sesame Street", "grandmother"], "emotion": "concern", "vocabulary": ["ambulance", "Sesame Street", "grandmother"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "medical"}
{"id": "mem_007", "text": "Yahya felt frustrated whenever names like Ami, Zoha, and Ridha were mentioned. He could not express his discomfort at the time, but now he understands how he feels and wishes those names were not brought up.", "tags": ["Ami", "Zoha", "Ridha", "emotions"], "emotion": "frustration", "vocabulary": ["Ami", "Zoha", "Ridha", "discomfort"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.9, "memory_type": "relationship"}
{"id": "mem_008", "text": "I felt super excited when I found out I was going to Houston by airplane. I remember feeling like I was going to fly away! I couldn't stop smiling at the time, but now I understand that it was because I had never been on a plane before and it felt like a big adventure.", "tags": ["airplane", "go", "houston"], "emotion": "excited", "vocabulary": ["airplane", "go", "houston"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "milestone"}
{"id": "mem_009", "text": "I felt happy and excited when I was going to meet my grandma. I remember feeling safe and loved when I was with her. I wish I could go back to that time and spend more time with her. Now I understand how much she meant to me and how much I miss her.", "tags": ["grandmom", "meeting"], "emotion": "excited", "vocabulary": ["grandmom", "meeting"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "milestone"}
{"id": "mem_010", "text": "I felt super excited when I found out I was going to Houston on an airplane this weekend. I couldn't wait to see the big city and all the tall buildings. Now I feel happy remembering how much fun I had on that trip.", "tags": ["airplane", "go", "houston"], "emotion": "excited", "vocabulary": ["airplane", "go", "houston"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_011", "text": "I felt super excited when I heard I was going to Houston! I couldn't wait to see all the cool things there. Now I feel happy thinking about how much fun I had.", "tags": ["weekend", "houston"], "emotion": "excited", "vocabulary": ["weekend", "houston"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_012", "text": "I felt super excited when I went on an airplane before. I remember feeling a little scared when the plane took off, but my parents held my hands and that made me feel better. I wish I could go on a plane again soon.", "tags": ["airplane"], "emotion": "confused", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.7, "memory_type": "milestone"}
{"id": "mem_013", "text": "I felt super excited when my dad took me to the airport for the first time. I couldn't believe how big and noisy the airplanes were! I remember feeling a little scared when the plane started moving, but my dad held my hand and told me everything was okay. Now I understand that it was just taking off, but back then it felt like a magic machine that could take me anywhere I wanted to go.", "tags": ["airplane"], "emotion": "curious", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "milestone"}
{"id": "mem_014", "text": "I felt curious and excited when I first saw a big airplane in the sky. I couldn't understand how it could fly so high, but now I feel amazed by how much I've learned about airplanes since then.", "tags": ["airplane"], "emotion": "curious", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.7, "memory_type": "experience"}
{"id": "mem_015", "text": "I felt super excited when my dad took me to the airport to see a big airplane for the first time. I couldn't believe how huge and noisy it was! I felt a little scared when it started moving, but my dad held my hand and said it was okay. I remember feeling proud that I was brave enough to watch it take off. Now I understand that it's just a normal thing for people to travel, but back then it felt like magic. I wish I could go on a plane ride again soon.", "tags": ["airplane"], "emotion": "curious", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "milestone"}
{"id": "mem_016", "text": "I felt super excited when my dad took me to the airport for the first time. I remember looking up at the big, giant machines with wings and wondering, \"What is an airplane?\" I felt a little nervous, too, because I had never seen anything like it. I couldn't understand how it could fly up in the air like a bird. Now I understand that it's like a big car that takes people on trips, but back then, it was like magic. I wish I could go back and feel that excitement again, but now I feel happy that I get to travel and see new places.", "tags": ["airplane"], "emotion": "curious", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_017", "text": "I felt so excited when I saw a big airplane flying high in the air. I couldn't understand how it could carry so many people and fly so high, but now I wish I could go on a plane ride again and feel that excitement.", "tags": ["airplane"], "emotion": "curious", "vocabulary": ["airplane"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_018", "text": "I felt super excited when I found out I was going to visit my grandparents in Houston. I couldn't wait to play with them and hear their funny stories. Now I wish I could have spent more time with them, but I'm happy I have those happy memories.", "tags": ["visit", "grandparent", "houston"], "emotion": "excited", "vocabulary": ["visit", "grandparent", "houston"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_019", "text": "I felt happy and safe when Grandma was around. I couldn't understand why she had to leave, but now I wish she was still here to give me hugs and make me feel loved.", "tags": ["love", "grandma"], "emotion": "happy", "vocabulary": ["love", "grandma"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.9, "memory_type": "preference"}
{"id": "mem_020", "text": "I felt super excited when my mom asked if we were going to Houston tomorrow. I couldn't wait to ride the big roller coaster at the amusement park! Now I understand that my mom was trying to make me happy, and it makes me feel loved when I think about it.", "tags": ["houston", "tomorrow", "go"], "emotion": "anxious", "vocabulary": ["houston", "tomorrow", "go"], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_021", "text": "I felt super scared and my heart was racing. I couldn't calm down at the time, but now I understand that it was okay to be nervous sometimes.", "tags": [], "emotion": "anxious", "vocabulary": [], "last_used": "2025-05-28", "used_count": 1, "importance_score": 0.8, "memory_type": "fear"}
{"id": "mem_022", "text": "I felt super excited when I heard we were going to Houston! I couldn't wait to see all the big buildings and ride in a plane for the first time. Now I understand that it was a big adventure for our whole family, and I feel happy thinking about it.", "tags": [], "emotion": "excited", "vocabulary": [], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "milestone"}
{"id": "mem_023", "text": "I felt excited and a little scared when I was going to hear something new. I couldn't wait to know what it was, but I was also worried it might be bad news. Now I understand that it's okay to feel both happy and scared at the same time.", "tags": ["hear", "okay", "today"], "emotion": "anxious", "vocabulary": ["hear", "okay", "today"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "fear"}
{"id": "mem_024", "text": "I felt excited when I was going to Grandma's house. I couldn't wait to play with her and eat her yummy food at the time, but now I feel happy remembering her smile and warm hugs.", "tags": ["grandma", "house"], "emotion": "excited", "vocabulary": ["grandma", "house"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "experience"}
{"id": "mem_025", "text": "I felt super excited when I asked if we were going to Houston. I remember feeling a mix of emotions, like my heart was racing and I couldn't wait to find out. At the time, I couldn't understand why it was such a big deal, but now I understand that it was a chance to explore a new place and make new memories with my family.", "tags": ["go", "houston"], "emotion": "anxious", "vocabulary": ["go", "houston"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "fear"}
{"id": "mem_026", "text": "I felt curious when my mom showed me a rainbow. I couldn't understand why it was so colorful and pretty at the time, but now I feel happy when I see a rainbow because it reminds me of my mom's smile.", "tags": ["rainbow"], "emotion": "curious", "vocabulary": ["rainbow"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.7, "memory_type": "experience"}
{"id": "mem_027", "text": "I felt scared and worried when I had to go to Grandma's house. I couldn't understand why I had to leave my home and family. Now I understand that Grandma was there to take care of me when I needed help, and I feel grateful for her love and support.", "tags": ["go", "upset", "house"], "emotion": "upset", "vocabulary": ["go", "upset", "house"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "emotional need"}
{"id": "mem_028", "text": "I felt scared and alone when someone asked me my name and I didn't know it. I couldn't understand why I didn't know something so important about myself. Now I feel sad when I think about it, but I'm also proud of myself for learning my name and being brave enough to ask for help.", "tags": ["name"], "emotion": "anxious", "vocabulary": ["name"], "last_used": "2025-05-29", "used_count": 1, "importance_score": 0.8, "memory_type": "fear"}